



#მეორე დავალება ---

#დაწერეთ პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს ნივთების რაოდენობა, რომლის შეძენაც სურს.
#დარწმუნდით, რომ მომხმარებელი შეიყვანს დადებითი რიცხვს.
#თითოეული ნივთისთვის, შესთავაზეთ მომხმარებელს შეიყვანოს ფასი.
#დარწმუნდით, რომ მომხმარებელი შეიყვანოს დადებითი რიცხვს პროდუქტის ფასისთვის.
#გამოთვალეთ და აჩვენეთ ყველა ელემენტის მთლიანი ღირებულება.


item = int(input("Enter items that you like:"))

price = int(input("Enter items price:"))

print(item * price)


#მესამე დავალება --- 



#დაწერეთ პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს წონა (კილოგრამებში) და სიმაღლე (მეტრებში).
#გამოთვალეთ სხეულის მასის ინდექსი (BMI) ფორმულის გამოყენებით: BMI = წონა / (სიმაღლე * სიმაღლე).
#გამოთვლილი BMI-დან გამომდინარე, მიაწოდეთ მომხმარებლის ჯანმრთელობის შეტყობინება:
#თუ BMI 18.5-ზე ნაკლებია, აჩვენეთ "Underweight". თუ BMI არის 18.5-დან 24.9-მდე,
#ჩვენება "ნორმალური წონა". თუ BMI არის 25-დან 29.9-მდე, აჩვენეთ "Overweight".
#თუ BMI არის 30 ან მეტი, აჩვენეთ "სიმსუქნე". 
#აჩვენეთ გამოთვლილი BMI და ჯანმრთელობის შეტყობინება გამოყენებისთვის

weight = int(input("Enter your Kg:"))
height = int(input("Enter your cm:"))

BMI = weight / (height * height)

print(int(BMI))

#?

#2) შედარებითი ოპერატორები

#გააკეთეთ 10 მაგალითი შედარებით ოპერატორებზე.

# or
print(5 > 6 or 9 > 6)
print(5 < 6 or 9 < 6)
print(9 > 6 or 6 == 6)
print(5 > 6 or 2 > 6)
print(7 > 6 or 8 > 3)

# and
print(4 > 7 and 9 < 6)
print(9 < 6 and 10 < 6)
print(8 == 8 and 6 == 6)
print(5 < 6 and 2 < 6)
print(1 > 6 and 9 > 3)

