# # 2)  დავალება
# ააგეთ პროგრამა, რომელიც მოსთხოვს მომხმარებელს, რომ შეიყვანეს რიცხვი 1 - 100 მდე.

# პროგრამის დანიშნულება არის ის, რომგამოიცნოს მომხმარებლის მიერ შემოტანილი რიცხვი,
# იმდენჯერ მიეცეს გამოცნობის შესაძლებლობა სანამ საბოლოოდ არ გამოიცნობს.


num = 56

while num != guss_num:
    guss_num  = int(input("Enter num from 1 to 100:"))

if guss_num == num:
    print("ypu gussed num")

else:
    print("you didnot guss num")




# # 3) დავალება

# 'FizzBuzz' 

#FizzBuzz მიზანი:

# შექმენით პროგრამა, რომელიც ბეჭდავს რიცხვებს 1-დან 100-მდე.
# თუმცა 3-ის ჯერადებისთვის რიცხვის ნაცვლად დაბეჭდეთ „Fizz“, ხოლო 5-ის ჯერადებისთვის დაბეჭდეთ „Buzz“.
# 3-ისა და 5-ის ჯერადი რიცხვებისთვის დაბეჭდეთ "FizzBuzz". 
# მოთხოვნები: გამოიყენეთ მარყუჟი 1-დან 100-მდე რიცხვების გასამეორებლად.
# გამოიყენეთ პირობითი განცხადებები, რათა შეამოწმოთ რიცხვი იყოფა 3-ზე, 5-ზე ან ორივეზე.
# დაბეჭდეთ შესაბამისი სიტყვა ("Fizz", "Buzz" ან "FizzBuzz") ან ნომერი.

for i in range(1, 101):
    if i % 3 == 0 and i % 5 ==0:
        print("FizzBuzz")

    elif i % 3 == 0:
       print("Fizz")
    elif i % 5 == 0:
        print("Buzz")
    print(i)


# 4) დავალება
# დაწერეთ პროგრამა სადაც შეამოწმეთ, სტუდენტმა ჩააბარა თუ არა ჩააბარა კურსი მათი გამოცდის ქულების მიხედვით.
# სთხოვეთ მომხმარებელს შეიყვანოს ქულები შუალედური გამოცდისთვის, დასკვნითი გამოცდისთვის და პროექტისთვის.
# დარწმუნდით, რომ მომხმარებელმა შეიყვანოს სწორი ქულები (პოზიტიური რიცხვები 0-დან 100-მდე) თითოეული კომპონენტისთვის.
# გამოიყენეთ შემდეგი შეფასების კრიტერიუმები: თუ საშუალო ქულა 
# (20% შუალედური კურსისთვის, 40% საბოლოო და 40% პროექტისთვის) არის 70 ან მეტი, სტუდენტი გაივლის კურსს.
# თუ საშუალო ქულა 70-ზე დაბალია, სტუდენტი ვერ ახერხებს კურსის ჩაბარებას. აჩვენეთ მომხმარებლისთვის შეტყობინება,
# რომელშიც მითითებულია მისი გავლის/ჩავარდნის სტატუსი და გამოთვლილი საშუალო ქულა.






middle_score = int(input("Enter middle score:"))
finally_score = int(input("Enter finaly score:"))
project_score = int(input("Enter priject score:"))

pass_or_fall = (middle_score + finally_score + project_score )

if pass_or_fall >= 70:
    print("you do this you go next tour")

else:
    print("you lose")

# 5) დავალება
# დაწერეთ პროგრამა სადაც შეამოწმებთ, აქვს თუ არა ადამიანს მართვის მოწმობის
# აღების უფლება მისი ასაკისა და მართვის გამოცდილებიდან გამომდინარე.
# დარწმუნდით, რომ მომხმარებელი შეიყვანს თავისი ასაკს და წლების რაოდენობა, რომელსაც მანქანას მართავდა.
# მომხმარებელმა უნდა შეიყვანოს დადებითი მთელი რიცხვები ასაკისა და მართვის გამოცდილებისთვის. (დაგნა მოხდეს ოპერაციები)
# გამოიყენეთ შემდეგი საკვალიფიკაციო კრიტერიუმები: პირი უნდა იყოს მინიმუმ 18 წლის მართვის მოწმობის მისაღებად.
# თუ პირი 18 წლამდეა, მას არ შეეძლება მართვის მოწმობის აღება.
# თუ პირი არის 18 წლის ან მეტი, მას უნდა ჰქონდეს მინიმუმ 1 წლიანი მართვის გამოცდილება,
# რომ დაშვებული იყოს მართვის მოწმობის აღებისთვის.
# მომხმარებლისთვის აჩვენეთ შეტყობინება, რომელშიც მითითებულია მართვის მოწმობის მიღების უფლება.


age = int(input("Enter your age:"))
experince = int(input("Enter your experience:"))

if age < 18:
    print("you cannot take a drive license")

elif age >= 18 and experince >= 1:
    print("you can take drive license")