#2) შექმენით სია და შეიტანეთ 
# 10 სხვადასხვა მონაცემთა ტიპის მნიშვნელობა, შემდეგ 5 მონაცემს  შეუცვალეთ   მნიშვნელობა
# და შემდეგ დაპრინტეთ მთლიანი სია.
#          0      1   2     3      4       5         6      7     8      9       10
list = ["carrot", 10, 1.4, True, False, "potato", "tomato", 101, 12.2, "CHADS", "GODS" ]

list[0] = "MESSI"

list[1] = "GOAT"

list[7] = 15.7

list[5] = 6

list[3] = False

print(list)



# 3) სიაში ელემენტების ჯამი
# შექმენი სია, რომელიც შეიცავს რიცხვებს. დაწერე კოდი,
# რომელიც გამოითვლის ამ სიის ელემენტების ჯამს და დაბეჭდავს შედეგს.













