// 2
let name = "Andria";

let num = 55;

let parsefloat = 4.4;

// 3

const name1 = "Andria1";

const num1 = 551;

const bool = True;

// 4.ახსენით კომენტარებით თუ რა არის let

//let არის JavaScript-ის საკვანძო სიტყვა რომელიც გამოიყენება ცვლადების განსასაზღვრავად
// მაგრამ let განსხვავდება const-ით რომ მას შეუძლია მისი მნიშვნელობის ცვლილების შეცვლა

// 5.ახსენით კომენტარებით თუ რა არის const

// const არის JavaScript-ის საკვანძო სიტყვა
// რომელიც გამოიყენება ცვლადების განსასაზღვრავად, მაგრამ მისი ძირითადი მახასიათებელია ის
// რომ განსაზღვრის შემდეგ მისი მნიშვნელობის ცვლილება შეუძლებელია

// 6.ახსენით კომენტარებით თუ რა განსხვავებაა let - ს,  const - ს და var - ს შორის.

// let განსხვავდება const-ით რომ მას შეუძლია მისი მნიშვნელობის ცვლილების შეცვლა
// var უბრალოდ დაძველდა და ის არ შეუძლია რაც let და const-ს