// 1. დაწერე for ციკლი, რომელიც გამოიტანს 1-დან 20-მდე ყველა რიცხვს, მაგრამ გამოტოვებს 7-ს და 13-ს.

for(let i = 1; i <= 20; i++){
    if(i == 7){
        continue;
    }
    if(i == 13){
        continue;
    }

    console.log(i);
}

// 2.დაწერეთ ციკლი, რომელიც გაივილის რიცხვებს 1-დან 30-მდე, გამოტოვეთ ყველა კენტი რიცხვი და შეაჩერეთ პროგრამა, როდესაც რიცხვი გაიყოფა 8 - ზე.

for (let i = 1; i <= 30; i++) {
    if (i % 2 !== 0) {
        continue;
    }

    if (i % 8 === 0) {
        break;
    }

    console.log(i);
}

// 3.შექმენით for ციკლი, რომელიც ამოწმებს რიცხვებს 1-დან 30-მდე, გამოტოვეთ რიცხვები, რომლებიც იყოფა 5 - ზე.

for (let i = 1; i <= 30; i++) {
    if (i % 5 === 0) {
        continue;
    }
    console.log(i);
}