// data types:
// Integer
// String
// Float
// Boolean

// Boolean - ერთ - ერთი 

// > - მეტია
// < - ნაკლებია
// >= - მეტი ან ტოლი
// <= - ნაკლენი ან ტოლი
// == - ტოლობა
// === - მკაცრი ტოლობა
// != - არ უდრის

console.log("10" == 10); // მექვივალენტობა მხოლოდ არ ეხება ტიპებს და შეადარებს მნიშვნელობებს მონაცემების ტიპის
// გარდაქმნის გარეშე. '10' არის სტრიქონი, მაგრამ ხდება ტიპის გარდაქმნა
// და შეადარება ხდება რიცხვთან 10. ასე რომ, მექვივალენტობა ამ შემთხვევაში ჭეშმარიტია (true),
// რადგან მონაცემების ტიპების განსხვავება იგნორირდება.

console.log("10" === 10); // მკაცრი ტოლობა ითვალისწინებს როგორც მნიშვნელობის თანაბრობას,
// ასევე მონაცემების ტიპების თანხვედრას. ამ შემთხვევაში '10' სტრიქონია, ხოლო 10 რიცხვი,
// ამიტომ მკაცრი ტოლობა ცრუ (false) იქნება, რადგან მონაცემების ტიპები არ ემთხვევა.





let age = Number(prompt("Enter your age:"));

if(age > 18){
    console.log("you can take license");
}
else if(age > 15){
    console.log("you can take license at 18");
}
else {
    console.log("you cannot take license");
}